Repository: AngelChv/proyecto_flutter
Catalog: lib/l10n/app_*.arb
Languages: es, it

source: YES
es: SI
it: SÌ

# films
source: Movies
es: Películas
it: Film

# createFilm
source: Create movie
es: Crear película
it: Crea film

# createdFilm
source: Movie created
es: Película creada
it: Film creato

# creatingFilmError
source: Error creating movie
es: Error al crear la película
it: Errore nella creazione del film

# deleteFilm
source: Delete movie
es: Eliminar película
it: Elimina film

# askDeletingFilm
source: Are you sure you want to delete the movie?
es: ¿Está seguro que desea eliminar la película?
it: Sei sicuro di voler eliminare il film?

# deletedFilm
source: Movie deleted
es: Película eliminada
it: Film eliminato

# deletingFilmError
source: Error deleting movie
es: Error al eliminar la película
it: Errore nell'eliminazione del film

# editFilm
source: Edit movie
es: Editar película
it: Modifica film

# editedFilm
source: Movie edited
es: Película modificada
it: Film modificato

# editingFilmError
source: Error editing movie
es: Error al modificar la película
it: Errore nella modifica del film

source: Title
es: Título
it: Titolo

# insertTheTitle
source: Enter the title
es: Introduzca el título
it: Inserisci il titolo

source: Director
it: Regista

# insertTheDirector
source: Enter the director
es: Introduzca el director
it: Inserisci il regista

# filmYear
source: Release year
es: Año del estreno
it: Anno di uscita

# insertFilmYear
source: Enter the release year
es: Introduzca el año de estreno
it: Inserisci l'anno di uscita

# insertValidYear
source: Please enter a valid year between {start} and {end}
es: Por favor, ingrese un año válido entre {start} y {end}
it: Per favore, inserisci un anno valido tra {start} e {end}

# clickDuration
source: Click to enter duration
es: Haga click para introducir la duración
it: Fai clic per inserire la durata

# insertDuration
source: Enter a duration
es: Introduzca una duración
it: Inserisci la durata

# insertValidDuration
source: Please enter a valid duration.
es: Por favor, ingrese una duración válida.
it: Per favore, inserisci una durata valida.

source: Description
es: Descripción
it: Descrizione

# insertDescription
source: Please enter a description
es: Por favor, inserte una descripción
it: Per favore, inserisci una descrizione

source: Nothing has been changed
es: No se ha modificado nada
it: Niente è stato modificato

source: Lists
es: Listas
it: Liste

source: Create list
es: Crear lista
it: Crea lista

source: Edit list
es: Editar lista
it: Modifica lista

# createdList
source: List created
es: Lista creada
it: Lista creata

# editedList
source: List edited
es: Lista editada
it: Lista modificata

# creatingListError
source: Error creating list
es: Error al crear la lista
it: Errore nella creazione della lista

# editingListError
source: Error editing list
es: Error al editar la lista
it: Errore nella modifica della lista

source: Name
es: nombre
it: Nome

# insertTheName
source: Enter the name
es: Introduce el nombre
it: Inserisci il nome

# deletedList
source: List deleted
es: Lista eliminada
it: Lista eliminata

source: Delete list
es: Eliminar lista
it: Elimina lista

# deletingListError
source: Error deleting list
es: Error al eliminar la lista
it: Errore nell'eliminazione della lista

# askDeletingList
source: Do you want to delete the list?
es: ¿Desea eliminar la lista?
it: Vuoi eliminare la lista?

# deletedFilmFromList
source: Movie removed from the list
es: Película eliminada de la lista
it: Film rimosso dalla lista

# deletingFilmFromListError
source: Error removing movie from the list
es: Error al eliminar la película de la lista
it: Errore nella rimozione del film dalla lista

# addFilmToList
source: Add movie
es: Añadir película
it: Aggiungi film

# filmAlreadyIsInList
source: The movie is already in the list
es: La película ya esta en la lista
it: Il film è già nella lista

# addFilmToListError
source: Error adding movie to the list
es: Error al añadir la película a la lista
it: Errore nell'aggiunta del film alla lista

# addedFilmToList
source: Movie added to the list
es: Película añadida a la lista
it: Film aggiunto alla lista

# deleteFilmFromList
source: Remove movie from the list
es: Eliminar película de la lista
it: Rimuovi film dalla lista

# askDeletingFilmFromList
source: Do you want to remove the movie from the list?
es: ¿Desea eliminar la película de la lista?
it: Vuoi rimuovere il film dalla lista?

source: Profile
es: Perfil
it: Profilo

source: Settings
es: Ajustes
it: Impostazioni

source: General
it: Generale

# generalSettings
source: Settings - General
es: Ajustes - General
it: Impostazioni - Generale

# profileSettings
source: Settings - Profile
es: Ajustes - Perfil
it: Impostazioni - Profilo

source: Dark mode
es: Modo oscuro
it: Modalità scura

source: Language
es: Idioma
it: Lingua

source: Log out
es: Cerrar sesión
it: Disconnettersi

source: Log in
es: Iniciar sesión
it: Accedi

source: Register
es: Registrarse
it: Registrati

source: Username
es: Nombre de usuario
it: Nome utente

# insertUsername
source: Enter the username
es: Complete el nombre de usuario
it: Inserisci il nome utente

# usernameExists
source: The username already exists
es: El nombre de usuario ya existe
it: Il nome utente esiste già

# insertEmail
source: Please enter an email
es: Por favor introduzca un email
it: Per favore, inserisci un'email

# invalidEmail
source: The email is not valid. (example@gmail.com)
es: El email no es válido. (ejemplo@gmail.com)
it: L'email non è valida. (esempio@gmail.com)

# insertPassword
source: Enter a password
es: Introduzca una contraseña
it: Inserisci una password

# shortPassword
source: The password is too short, it must be at least 8 characters.
es: La contraseña es demasiado corta, debe tener al menos 8 caracteres.
it: La password è troppo corta, deve avere almeno 8 caratteri.

source: Repeat password
es: Repetir contraseña
it: Ripeti password

# insertRepeatPassword
source: Enter the password again
es: Introduzca otra vez la contraseña
it: Inserisci di nuovo la password

# passwordsDontMatch
source: Passwords do not match
es: Las contraseñas no coinciden
it: Le password non coincidono

# registerError
source: Error registering
es: Error al registrarse
it: Errore nella registrazione

# usernameAndPasswordDontMatch
source: Incorrect username or password
es: Nombre de usuario o contraseña incorrectos
it: Nome utente o password errati

# savedFilms
source: Saved movies
es: Películas guardadas
it: Film salvati

source: Created lists
es: Listas creadas
it: Liste create

source: Password
es: Contraseña
